cursos_previos/Curso_CFD_OS_2019/cilindro_snappy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);


boundaryField
{
    inlet
    {
        type            fixedValue;
	value uniform (1 0 0);

    }

    outlet
    {
        type            inletOutlet;
	inletValue  (0 0 0);
	value uniform (1 0 0);
    }

    cilindro
      {
	type noSlip;
      }
    
    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

}


// ************************************************************************* //
